<a href="https://colab.research.google.com/github/saurabhdaund76/Book-Recommendation-System/blob/main/Book_recommendation_system.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [2]:
# reading user csv
user_df = pd.read_csv('/content/drive/MyDrive/ML projects/Users.csv')

In [3]:
# reading ratings csv
ratings_df = pd.read_csv('/content/drive/MyDrive/ML projects/Ratings.csv')

In [8]:
# reading books csv
books_df = pd.read_csv('/content/drive/MyDrive/ML projects/Books.csv')

/usr/local/lib/python3.7/dist-packages/IPython/core/interactiveshell.py:2718: DtypeWarning: Columns (3) have mixed types.Specify dtype option on import or set low_memory=False.
  interactivity=interactivity, compiler=compiler, result=result)

In [10]:
# shape of all df

print(ratings_df.shape)
print(user_df.shape)
print(books_df.shape)

(1149780, 3)
(278858, 3)
(271360, 8)

In [6]:
ratings_df.head()

   User-ID        ISBN  Book-Rating
0   276725  034545104X            0
1   276726  0155061224            5
2   276727  0446520802            0
3   276729  052165615X            3
4   276729  0521795028            6

In [11]:
ratings_df['User-ID'].value_counts()

11676     13602
198711     7550
153662     6109
98391      5891
35859      5850
          ...
158698        1
17920         1
277135        1
275086        1
187812        1
Name: User-ID, Length: 105283, dtype: int64

In [23]:
ratings_df.groupby('User-ID')['Book-Rating'].sum().reset_index()

        User-ID  Book-Rating
0             2            0
1             7            0
2             8           39
3             9            6
4            10            6
...         ...          ...
105278   278846            8
105279   278849            9
105280   278851           91
105281   278852            8
105282   278854           42

[105283 rows x 2 columns]